Documents/ЭкзаменыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЭкзаменыПродавцов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуВидео</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросовВЭкзамене</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВерныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОпросникДляЭкзаменацииПродавца</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравильныйОтвет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВопросовВЭкзамене</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидеоЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуВидео</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеОбъектРоль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеОбъектРоль</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРолиID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыРолейПользователя</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РолиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РолиПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРолейПользователейМОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик_СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расчетчики</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРолиСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЛентыКартинок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставРоли</Name>
					<Comment>Сотрудники, входящие в роль в данной ИБ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураХарактеристика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыРолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипРоли</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставТранспортРазвоз</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Откуда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куда</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРозничныхТочек</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобытияАвторассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СобытияАвторассылкиМОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассылатьДочернимРолям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРакурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ракурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МП_Ракурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЭкзаменыПродавцов/Ext/ManagerModule.bsl
Процедура РассылкаОПлохихРезультатахЭкзаменов() Экспорт
	ТекстЗапроса="ВЫБРАТЬ
             |	СоответствиеОбъектРольСрезПоследних.Объект КАК Объект,
             |	МАКСИМУМ(РолиПользователейСоставРоли.Сотрудник) КАК Сотрудник,
             |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформацияПочта.Представление КАК СТРОКА(100))) КАК Почта,
             |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформацияТелефон.Представление КАК СТРОКА(100))) КАК Телефон
             |ПОМЕСТИТЬ Помощники
             |ИЗ
             |	Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&ДатаПо, ) КАК СоответствиеОбъектРольСрезПоследних
             |		ПО РолиПользователейСоставРоли.Ссылка = СоответствиеОбъектРольСрезПоследних.РольПользователя
             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияПочта
             |		ПО РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформацияПочта.Объект
             |			И (КонтактнаяИнформацияПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
             |		ПО РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформацияТелефон.Объект
             |			И (КонтактнаяИнформацияТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
             |ГДЕ
			 //+++ AK suvv 2018.06.08 ИП-00018376.01
			 //|	СоответствиеОбъектРольСрезПоследних.ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникТерриториальногоУправляющего)
			 |	(СоответствиеОбъектРольСрезПоследних.ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникТерриториальногоУправляющего)
			 | ИЛИ СоответствиеОбъектРольСрезПоследних.ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникСтороннейРозницы))
			 //--- AK suvv
             |
             |СГРУППИРОВАТЬ ПО
             |	СоответствиеОбъектРольСрезПоследних.Объект
             |;
             |
             |////////////////////////////////////////////////////////////////////////////////
             |ВЫБРАТЬ
             |	Помощники.Сотрудник КАК ПомощникТУ,
             |	Помощники.Почта КАК ПочтаПомощника,
             |	Помощники.Сотрудник.Руководитель КАК ТУ,
             |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))) КАК ПочтаТУ
             |ИЗ
             |	Документ.ЭкзаменыПродавцов.Вопросы КАК ЭкзаменыПродавцовВопросы
             |		ЛЕВОЕ СОЕДИНЕНИЕ Помощники КАК Помощники
             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
             |			ПО Помощники.Сотрудник.Руководитель = КонтактнаяИнформация.Объект
             |				И (КонтактнаяИнформация.Тип = &ТипКИ_Почта)
             |		ПО ЭкзаменыПродавцовВопросы.Ссылка.ТорговаяТочка = Помощники.Объект
             |ГДЕ
             |	ЭкзаменыПродавцовВопросы.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
             |	И ЭкзаменыПродавцовВопросы.Ссылка.Проведен
             |	И ЭкзаменыПродавцовВопросы.Ссылка.ПроцентВерныхОтветов < 90
             |	И ЭкзаменыПродавцовВопросы.Ссылка.Должность.Наименование <> ""Стажер""
             |
             |СГРУППИРОВАТЬ ПО
             |	Помощники.Сотрудник,
             |	Помощники.Почта,
             |	Помощники.Сотрудник.Руководитель";
	Запрос = Новый Запрос(ТекстЗапроса);
	ТекДата = ТекущаяДата();
	Если День(ТекДата) < 15 Тогда
		НачПериода = НачалоМесяца((НачалоМесяца(ТекДата-1)));
		КонПериода = НачалоМесяца(ТекДата-1);
	Иначе
		НачПериода = НачалоМесяца(ТекДата);
		КонПериода = КонецМесяца(ТекДата);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаС",НачПериода);
	Запрос.УстановитьПараметр("ДатаПо",КонПериода);
	Запрос.УстановитьПараметр("ТипКИ_Почта",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Результат = Запрос.Выполнить().Выгрузить();
	ТЗОтправки = Результат.Скопировать();
	ТЗОтправки.Свернуть("ТУ,ПочтаТУ");
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СКД=Отчеты.РезультатыЭкзаменовПродавцов.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СКД.Параметры.ДатаС.Значение = Запрос.Параметры.ДатаС;
	СКД.Параметры.ДатаПо.Значение = Запрос.Параметры.ДатаПо;
		
	Для Каждого Выборка ИЗ ТЗОтправки Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		
		НастройкиСКД = СКД.НастройкиПоУмолчанию;
		
		Для каждого Эл Из НастройкиСКД.Отбор.Элементы Цикл
			Если СокрЛП(Эл.ЛевоеЗначение) = "ТУ" Тогда
				Эл.Использование = Истина;
				Эл.ПравоеЗначение = Выборка.ТУ;
			КонецЕсли;
			Если СокрЛП(Эл.ЛевоеЗначение) = "ПомощникТУ" Тогда
				Эл.Использование = Ложь;
			КонецЕсли;
		КонецЦикла;	
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиСКД, ДанныеРасшифровки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровки);
		
		ТабДок=Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ТабДок);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ИмяФайла=Новый УникальныйИдентификатор;
		ИмяФайла=КаталогВременныхФайлов()+ИмяФайла+".pdf";
		
		ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабДок.АвтоМасштаб = Истина;
		
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		
		//Отправка письма
		Адрес = СокрЛП(Выборка.ПочтаТУ);
		СписокКому = Новый СписокЗначений;
		Если Адрес<>"" Тогда
			СпАдресов=Новый СписокЗначений;
			МассивАдресов=Справочники.Контрагенты.РазложитьСтрокуВМассивПодстрок(Адрес,";");	
			Для каждого Эл Из МассивАдресов Цикл
				Если ЗначениеЗаполнено(Эл) Тогда
					СписокКому.Добавить(СокрЛП(Эл));
				КонецЕсли; 
			КонецЦикла; 
			
		Иначе
			Сообщить("Письмо не отправлено! Не заполнен адрес электронной почты "+Выборка.ТУ);
			Продолжить;
		КонецЕсли;
		
		
		
		//СписокКому.Добавить("pozm@automacon.ru");
		//СписокКому.Добавить("job@izbenka.msk.ru");
		//СписокКому.Добавить("abdr@automacon.ru");
		
		
		
		УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
		
		Почта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		Письмо = Новый ИнтернетПочтовоеСообщение;
		
		Почта.Подключиться(Профиль);
		Письмо.Тема = "Сотрудники с результатов сдачи опроса ниже 90%, отчет по территориальному управляющему: "+Выборка.ТУ;
		Письмо.ИмяОтправителя 	= "" + УчетнаяЗапись + "";
		Письмо.ИмяОтправителя  	= "" + СокрЛП(УчетнаяЗапись) + "";
		Письмо.Отправитель     	= "" + СокрЛП(УчетнаяЗапись) + "";
		Для Каждого ПолучательЭлемент Из СписокКому Цикл
			Получатель = Письмо.Получатели.Добавить();
			Получатель.Адрес = ПолучательЭлемент.Значение;
		КонецЦикла;	
		
		ТекстСообщения = Письмо.Тексты.Добавить();

		ТекстСообщения.Текст     = "Во вложении находится отчет о сотрудниках с результатами опроса ниже 90%";
		
		ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		
		Письмо.Вложения.Добавить(ИмяФайла);
		
		
		Почта.Послать(Письмо);
		
		Почта.Отключиться();
		
		Сообщить("Отправлено письмо "+Выборка.ТУ);
						
	КонецЦикла;	
	/////////////////////////////////////////////////////////////////////
	ТЗОтправки = Результат.Скопировать();
	ТЗОтправки.Свернуть("ПомощникТУ,ПочтаПомощника");
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СКД=Отчеты.РезультатыЭкзаменовПродавцов.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СКД.Параметры.ДатаС.Значение = Запрос.Параметры.ДатаС;
	СКД.Параметры.ДатаПо.Значение = Запрос.Параметры.ДатаПо;
		
	Для Каждого Выборка ИЗ ТЗОтправки Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		
		НастройкиСКД = СКД.НастройкиПоУмолчанию;
		
		Для каждого Эл Из НастройкиСКД.Отбор.Элементы Цикл
			Если СокрЛП(Эл.ЛевоеЗначение) = "ТУ" Тогда
				Эл.Использование = Ложь;
				
			КонецЕсли;
			Если СокрЛП(Эл.ЛевоеЗначение) = "ПомощникТУ" Тогда
				Эл.Использование = Истина;
				Эл.ПравоеЗначение = Выборка.ПомощникТУ;
			КонецЕсли;
		КонецЦикла;	
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиСКД, ДанныеРасшифровки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровки);
		
		ТабДок=Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ТабДок);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ИмяФайла=Новый УникальныйИдентификатор;
		ИмяФайла=КаталогВременныхФайлов()+ИмяФайла+".pdf";
		
		ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабДок.АвтоМасштаб = Истина;
		
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		
		//Отправка письма
		Адрес = СокрЛП(Выборка.ПочтаПомощника);
		СписокКому = Новый СписокЗначений;
		Если Адрес<>"" Тогда
			СпАдресов=Новый СписокЗначений;
			МассивАдресов=Справочники.Контрагенты.РазложитьСтрокуВМассивПодстрок(Адрес,";");	
			Для каждого Эл Из МассивАдресов Цикл
				Если ЗначениеЗаполнено(Эл) Тогда
					СписокКому.Добавить(СокрЛП(Эл));
				КонецЕсли; 
			КонецЦикла; 
			
		Иначе
			Сообщить("Письмо не отправлено! Не заполнен адрес электронной почты "+Выборка.ПомощникТУ);
			Продолжить;
		КонецЕсли;
		
		
		//
		//СписокКому.Добавить("pozm@automacon.ru");
		//СписокКому.Добавить("job@izbenka.msk.ru");
		//СписокКому.Добавить("abdr@automacon.ru");
		
		
		УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
		
		Почта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		Письмо = Новый ИнтернетПочтовоеСообщение;
		
		Почта.Подключиться(Профиль);
		Письмо.Тема = "Сотрудники с результатов сдачи опроса ниже 90%, отчет по помощнику территориального управляющего: "+Выборка.ПомощникТУ;
		Письмо.ИмяОтправителя 	= "" + УчетнаяЗапись + "";
		Письмо.ИмяОтправителя  	= "" + СокрЛП(УчетнаяЗапись) + "";
		Письмо.Отправитель     	= "" + СокрЛП(УчетнаяЗапись) + "";
		Для Каждого ПолучательЭлемент Из СписокКому Цикл
			Получатель = Письмо.Получатели.Добавить();
			Получатель.Адрес = ПолучательЭлемент.Значение;
		КонецЦикла;	
		
		ТекстСообщения = Письмо.Тексты.Добавить();

		ТекстСообщения.Текст     = "Во вложении находится отчет о сотрудниках с результатами опроса ниже 90%";
		
		ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		
		Письмо.Вложения.Добавить(ИмяФайла);
		
		
		Почта.Послать(Письмо);
		
		Почта.Отключиться();
		
		Сообщить("Отправлено письмо "+Выборка.ПомощникТУ);
			
		
	КонецЦикла;	
КонецПроцедуры
